ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC1_0.0.xml
    <register id="HSADC1_ADCDMAINTSEL_M33_" width="32" offset="0x1014" description="ADC DMA Interrupt 1, 2, 3 and 4 Selection Register">
        <bitfield id="DMAINT1SEL" description="ADCDMAINT1 EOC Source Select #br#  00h  EOC0 is trigger for ADCDMAINT1 #br#  01h  EOC1 is trigger for ADCDMAINT1 #br#  02h  EOC2 is trigger for ADCDMAINT1 #br#  03h  EOC3 is trigger for ADCDMAINT1 #br#  04h  EOC4 is trigger for ADCDMAINT1 #br#  05h  EOC5 is trigger for ADCDMAINT1 #br#  06h  EOC6 is trigger for ADCDMAINT1 #br#  07h  EOC7 is trigger for ADCDMAINT1 #br#  08h  EOC8 is trigger for ADCDMAINT1 #br#  09h  EOC9 is trigger for ADCDMAINT1 #br#  0Ah  EOC10 is trigger for ADCDMAINT1 #br#  0Bh  EOC11 is trigger for ADCDMAINT1 #br#  0Ch  EOC12 is trigger for ADCDMAINT1 #br#  0Dh  EOC13 is trigger for ADCDMAINT1 #br#  0Eh  EOC14 is trigger for ADCDMAINT1 #br#  0Fh  EOC15 is trigger for ADCDMAINT1 #br# #br#Note : When oversampling is enabled, the end of the last oversampled conversion will trigger the DMAINTerrupts #br#" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT1CONT" description="ADCDMAINT1 Continue to Interrupt Mode #br#  0  No further ADCDMAINT1 pulses are generated until ADCDMAINT1 flag (in ADCDMAINTFLG register) is cleared by user. #br#  1  ADCDMAINT1 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT1E" description="ADCDMAINT1 Interrupt Enable #br#  0  ADCDMAINT1 is disabled #br#  1  ADCDMAINT1 is enabled" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT2SEL" description="ADCDMAINT2 EOC Source Select #br#  00h  EOC0 is trigger for ADCDMAINT2 #br#  01h  EOC1 is trigger for ADCDMAINT2 #br#  02h  EOC2 is trigger for ADCDMAINT2 #br#  03h  EOC3 is trigger for ADCDMAINT2 #br#  04h  EOC4 is trigger for ADCDMAINT2 #br#  05h  EOC5 is trigger for ADCDMAINT2 #br#  06h  EOC6 is trigger for ADCDMAINT2 #br#  07h  EOC7 is trigger for ADCDMAINT2 #br#  08h  EOC8 is trigger for ADCDMAINT2 #br#  09h  EOC9 is trigger for ADCDMAINT2 #br#  0Ah  EOC10 is trigger for ADCDMAINT2 #br#  0Bh  EOC11 is trigger for ADCDMAINT2 #br#  0Ch  EOC12 is trigger for ADCDMAINT2 #br#  0Dh  EOC13 is trigger for ADCDMAINT2 #br#  0Eh  EOC14 is trigger for ADCDMAINT2 #br#  0Fh  EOC15 is trigger for ADCDMAINT2 #br# #br#Note : When oversampling is enabled, the end of the last oversampled coversion will trigger the DMAINTerrupts #br#" begin="11" end="8" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT2CONT" description="ADCDMAINT2 Continue to Interrupt Mode #br#  0  No further ADCDMAINT2 pulses are generated until ADCDMAINT2 flag (in ADCDMAINTFLG register) is cleared by user. #br#  1  ADCDMAINT2 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT2E" description="ADCDMAINT2 Interrupt Enable #br#  0  ADCDMAINT2 is disabled #br#  1  ADCDMAINT2 is enabled" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT3SEL" description="ADCDMAINT3 EOC Source Select #br#  00h  EOC0 is trigger for ADCDMAINT3 #br#  01h  EOC1 is trigger for ADCDMAINT3 #br#  02h  EOC2 is trigger for ADCDMAINT3 #br#  03h  EOC3 is trigger for ADCDMAINT3 #br#  04h  EOC4 is trigger for ADCDMAINT3 #br#  05h  EOC5 is trigger for ADCDMAINT3 #br#  06h  EOC6 is trigger for ADCDMAINT3 #br#  07h  EOC7 is trigger for ADCDMAINT3 #br#  08h  EOC8 is trigger for ADCDMAINT3 #br#  09h  EOC9 is trigger for ADCDMAINT3 #br#  0Ah  EOC10 is trigger for ADCDMAINT3 #br#  0Bh  EOC11 is trigger for ADCDMAINT3 #br#  0Ch  EOC12 is trigger for ADCDMAINT3 #br#  0Dh  EOC13 is trigger for ADCDMAINT3 #br#  0Eh  EOC14 is trigger for ADCDMAINT3 #br#  0Fh  EOC15 is trigger for ADCDMAINT3 #br# #br#Note : When oversampling is enabled, the end of the last oversampled coversion will trigger the DMAINTerrupts #br#" begin="19" end="16" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT3CONT" description="ADCDMAINT3 Continue to Interrupt Mode #br#  0  No further ADCDMAINT3 pulses are generated until ADCDMAINT3 flag (in ADCDMAINTFLG register) is cleared by user. #br#  1  ADCDMAINT3 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT3E" description="ADCDMAINT3 Interrupt Enable #br#  0  ADCDMAINT3 is disabled #br#  1  ADCDMAINT3 is enabled" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT4SEL" description="ADCDMAINT4 EOC Source Select #br#  00h  EOC0 is trigger for ADCDMAINT4 #br#  01h  EOC1 is trigger for ADCDMAINT4 #br#  02h  EOC2 is trigger for ADCDMAINT4 #br#  03h  EOC3 is trigger for ADCDMAINT4 #br#  04h  EOC4 is trigger for ADCDMAINT4 #br#  05h  EOC5 is trigger for ADCDMAINT4 #br#  06h  EOC6 is trigger for ADCDMAINT4 #br#  07h  EOC7 is trigger for ADCDMAINT4 #br#  08h  EOC8 is trigger for ADCDMAINT4 #br#  09h  EOC9 is trigger for ADCDMAINT4 #br#  0Ah  EOC10 is trigger for ADCDMAINT4 #br#  0Bh  EOC11 is trigger for ADCDMAINT4 #br#  0Ch  EOC12 is trigger for ADCDMAINT4 #br#  0Dh  EOC13 is trigger for ADCDMAINT4 #br#  0Eh  EOC14 is trigger for ADCDMAINT4 #br#  0Fh  EOC15 is trigger for ADCDMAINT4 #br# #br#Note : When oversampling is enabled, the end of the last oversampled coversion will trigger the DMAINTerrupts #br#" begin="27" end="24" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT4CONT" description="ADCDMAINT4 Continue to Interrupt Mode #br#  0  No further ADCDMAINT4 pulses are generated until ADCDMAINT4 flag (in ADCDMAINTFLG register) is cleared by user. #br#  1  ADCDMAINT4 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT4E" description="ADCDMAINT4 Interrupt Enable #br#  0  ADCDMAINT4 is disabled #br#  1  ADCDMAINT4 is enabled" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
