ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC1_0.0.xml
    <register id="HSADC1_ADCINTOVF_4INT" width="32" offset="0x1028" description="ADC Interrupt Overflow Register">
        <bitfield id="ADCINT1OVF" description="ADC Interrupt 1 Overflow Flags #br# #br#Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs. #br# #br#  0  No ADC interrupt overflow event detected. #br#  1  ADC Interrupt overflow event detected. #br# #br#The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCINT2OVF" description="ADC Interrupt 2 Overflow Flags #br# #br#Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs. #br# #br#  0  No ADC interrupt overflow event detected. #br#  1  ADC Interrupt overflow event detected. #br# #br#The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCINT3OVF" description="ADC Interrupt 3 Overflow Flags #br# #br#Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs. #br# #br#  0  No ADC interrupt overflow event detected. #br#  1  ADC Interrupt overflow event detected. #br# #br#The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCINT4OVF" description="ADC Interrupt 4 Overflow Flags #br# #br#Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs. #br# #br#  0  No ADC interrupt overflow event detected. #br#  1  ADC Interrupt overflow event detected. #br# #br#The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCDMAINT1OVF" description="ADC DMA Interrupt 1 Overflow Flags #br# #br#Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs. #br# #br#  0  No ADC DMA Interrupt overflow event detected. #br#  1  ADC DMA Interrupt overflow event detected. #br# #br#The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." begin="16" end="16" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCDMAINT2OVF" description="ADC DMA Interrupt 2 Overflow Flags #br# #br#Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs. #br# #br#  0  No ADC DMA Interrupt overflow event detected. #br#  1  ADC DMA Interrupt overflow event detected. #br# #br#The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." begin="17" end="17" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCDMAINT3OVF" description="ADC DMA Interrupt 3 Overflow Flags #br# #br#Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs. #br# #br#  0  No ADC DMA Interrupt overflow event detected. #br#  1  ADC DMA Interrupt overflow event detected. #br# #br#The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." begin="18" end="18" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCDMAINT4OVF" description="ADC DMA Interrupt 4 Overflow Flags #br# #br#Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs. #br# #br#  0  No ADC DMA Interrupt overflow event detected. #br#  1  ADC DMA Interrupt overflow event detected. #br# #br#The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." begin="19" end="19" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCINTOVFCLR_4INT" width="32" offset="0x102C" description="ADC Interrupt Overflow Clear Register">
        <bitfield id="ADCINT1OVF" description="ADC Interrupt 1 Overflow Clear Bits #br# #br#  0  No action. #br#  1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ADCINT2OVF" description="ADC Interrupt 2 Overflow Clear Bits #br# #br#  0  No action. #br#  1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ADCINT3OVF" description="ADC Interrupt 3 Overflow Clear Bits #br# #br#  0  No action. #br#  1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ADCINT4OVF" description="ADC Interrupt 4 Overflow Clear Bits #br# #br#  0  No action. #br#  1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ADCDMAINT1OVF" description="ADC DMA Interrupt 1 Overflow Clear Bits #br# #br#  0  No action. #br#  1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ADCDMAINT2OVF" description="ADC DMA Interrupt 2 Overflow Clear Bits #br# #br#  0  No action. #br#  1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ADCDMAINT3OVF" description="ADC DMA Interrupt 3 Overflow Clear Bits #br# #br#  0  No action. #br#  1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ADCDMAINT4OVF" description="ADC DMA Interrupt 4 Overflow Clear Bits #br# #br#  0  No action. #br#  1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSOCPRICTL_LITE_" width="32" offset="0x1030" description="ADC SOC Priority Control Register">
        <bitfield id="SOCPRIORITY" description="SOC Priority #br#Determines the cutoff point for priority mode and round robin arbitration for SOCx #br#  0h  SOC priority is handled in round robin mode for all channels. #br#  1h  SOC0 is high priority, rest of channels are in round robin mode. #br#  2h  SOC0-SOC1 are high priority, SOC2-SOC15 are in round robin mode. #br#  3h  SOC0-SOC2 are high priority, SOC3-SOC15 are in round robin mode." begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="RRPOINTER" description="Round Robin Pointer. Holds the value of the last converted round robin SOCx to be used by the round robin scheme to determine order of conversions. #br#  00h  SOC0 was last round robin SOC to convert, SOC1 is highest round robin priority. #br#  01h  SOC1 was last round robin SOC to convert, SOC2 is highest round robin priority. #br#  02h  SOC2 was last round robin SOC to convert, SOC3 is highest round robin priority. #br#  03h  SOC3 was last round robin SOC to convert, SOC4 is highest round robin priority. #br#  04h  SOC4 was last round robin SOC to convert, SOC5 is highest round robin priority. #br#  05h  SOC5 was last round robin SOC to convert, SOC6 is highest round robin priority. #br#  06h  SOC6 was last round robin SOC to convert, SOC7 is highest round robin priority. #br#  07h  SOC7 was last round robin SOC to convert, SOC8 is highest round robin priority. #br#  08h  SOC8 was last round robin SOC to convert, SOC9 is highest round robin priority. #br#  09h  SOC9 was last round robin SOC to convert, SOC10 is highest round robin priority. #br#  0Ah  SOC10 was last round robin SOC to convert, SOC11 is highest round robin priority. #br#  0Bh  SOC11 was last round robin SOC to convert, SOC12 is highest round robin priority. #br#  0Ch  SOC12 was last round robin SOC to convert, SOC13 is highest round robin priority. #br#  0Dh  SOC13 was last round robin SOC to convert, SOC14 is highest round robin priority. #br#  0Eh  SOC14 was last round robin SOC to convert, SOC15 is highest round robin priority. #br#  0Fh  SOC15 was last round robin SOC to convert, SOC0 is highest round robin priority. #br#  10h  Reset value to indicate no SOC has been converted. SOC0 is highest round robin priority. Set to this value when the ADC module is reset by SOFTPRES or when the ADCSOCPRICTL register is written. In the latter case, if a conversion is currently in progress, it will complete and then the new priority will take effect. #br#Others  Invalid value." begin="10" end="6" width="5" rwaccess="R">
        </bitfield>
    </register>
