ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC1_0.0.xml
    <register id="HSADC1_ADCINTSOCSEL1_LITE_" width="32" offset="0x1034" description="ADC Interrupt SOC Selection 1 Register">
        <bitfield id="SOC0" description="SOC0 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC0. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC0. TRIGSEL field alone determines SOC0 trigger. #br#  01  ADCINT1 will trigger SOC0. #br#  10  ADCINT2 will trigger SOC0. #br#  11  EOC[N-1] will trigger SOC0. #br#N - Total number of SOCs supported" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC1" description="SOC1 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC1. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC1. TRIGSEL field alone determines SOC1 trigger. #br#  01  ADCINT1 will trigger SOC1. #br#  10  ADCINT2 will trigger SOC1. #br#  11  EOC0 will trigger SOC1." begin="3" end="2" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC2" description="SOC2 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC2. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC2. TRIGSEL field alone determines SOC2 trigger. #br#  01  ADCINT1 will trigger SOC2. #br#  10  ADCINT2 will trigger SOC2. #br#  11  EOC1 will trigger SOC2." begin="5" end="4" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC3" description="SOC3 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC3. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC3. TRIGSEL field alone determines SOC3 trigger. #br#  01  ADCINT1 will trigger SOC3. #br#  10  ADCINT2 will trigger SOC3. #br#  11  EOC2 will trigger SOC3." begin="7" end="6" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC4" description="SOC4 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC4. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC4. TRIGSEL field alone determines SOC4 trigger. #br#  01  ADCINT1 will trigger SOC4. #br#  10  ADCINT2 will trigger SOC4. #br#  11  EOC3 will trigger SOC4." begin="9" end="8" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC5" description="SOC5 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC5. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC5. TRIGSEL field alone determines SOC5 trigger. #br#  01  ADCINT1 will trigger SOC5. #br#  10  ADCINT2 will trigger SOC5. #br#  11  EOC4 will trigger SOC5." begin="11" end="10" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC6" description="SOC6 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC6. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC6. TRIGSEL field alone determines SOC6 trigger. #br#  01  ADCINT1 will trigger SOC6. #br#  10  ADCINT2 will trigger SOC6. #br#  11  EOC5 will trigger SOC6." begin="13" end="12" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC7" description="SOC7 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC7. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC7. TRIGSEL field alone determines SOC7 trigger. #br#  01  ADCINT1 will trigger SOC7. #br#  10  ADCINT2 will trigger SOC7. #br#  11  EOC6 will trigger SOC7." begin="15" end="14" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC8" description="SOC8 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC8. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC8. TRIGSEL field alone determines SOC8 trigger. #br#  01  ADCINT1 will trigger SOC8. #br#  10  ADCINT2 will trigger SOC8. #br#  11  EOC7 will trigger SOC8." begin="17" end="16" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC9" description="SOC9 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC9. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC9. TRIGSEL field alone determines SOC9 trigger. #br#  01  ADCINT1 will trigger SOC9. #br#  10  ADCINT2 will trigger SOC1. #br#  11  EOC8 will trigger SOC9." begin="19" end="18" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC10" description="SOC10 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC10. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC10. TRIGSEL field alone determines SOC10 trigger. #br#  01  ADCINT1 will trigger SOC10. #br#  10  ADCINT2 will trigger SOC10. #br#  11  EOC9 will trigger SOC10." begin="21" end="20" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC11" description="SOC11 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC11. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC11. TRIGSEL field alone determines SOC11 trigger. #br#  01  ADCINT1 will trigger SOC11. #br#  10  ADCINT2 will trigger SOC11. #br#  11  EOC10 will trigger SOC11." begin="23" end="22" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC12" description="SOC12 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC12. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC12. TRIGSEL field alone determines SOC12 trigger. #br#  01  ADCINT1 will trigger SOC12. #br#  10  ADCINT2 will trigger SOC12. #br#  11  EOC11 will trigger SOC12." begin="25" end="24" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC13" description="SOC13 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC13. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC13. TRIGSEL field alone determines SOC13 trigger. #br#  01  ADCINT1 will trigger SOC13. #br#  10  ADCINT2 will trigger SOC13. #br#  11  EOC12 will trigger SOC13." begin="27" end="26" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC14" description="SOC14 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC14. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC14. TRIGSEL field alone determines SOC14 trigger. #br#  01  ADCINT1 will trigger SOC14. #br#  10  ADCINT2 will trigger SOC14. #br#  11  EOC13 will trigger SOC14." begin="29" end="28" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC15" description="SOC15 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC15. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC15. TRIGSEL field alone determines SOC15 trigger. #br#  01  ADCINT1 will trigger SOC15. #br#  10  ADCINT2 will trigger SOC15. #br#  11  EOC14 will trigger SOC15." begin="31" end="30" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCINTSOCSEL2_TYPE5P0_" width="32" offset="0x1038" description="ADC Interrupt SOC Selection 2 Register">
        <bitfield id="SOC16" description="SOC16 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC16. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC16. TRIGSEL field alone determines SOC16 trigger. #br#  01  ADCINT1 will trigger SOC16. #br#  10  ADCINT2 will trigger SOC16. #br#  11  Invalid selection." begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC17" description="SOC17 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC17. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC17. TRIGSEL field alone determines SOC0 trigger. #br#  01  ADCINT1 will trigger SOC17. #br#  10  ADCINT2 will trigger SOC17. #br#  11  Invalid selection." begin="3" end="2" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC18" description="SOC18 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC18. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC18. TRIGSEL field alone determines SOC0 trigger. #br#  01  ADCINT1 will trigger SOC18. #br#  10  ADCINT2 will trigger SOC18. #br#  11  Invalid selection." begin="5" end="4" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC19" description="SOC19 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC19. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC19. TRIGSEL field alone determines SOC0 trigger. #br#  01  ADCINT1 will trigger SOC19. #br#  10  ADCINT2 will trigger SOC19. #br#  11  Invalid selection." begin="7" end="6" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC20" description="SOC20 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC20. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC20. TRIGSEL field alone determines SOC0 trigger. #br#  01  ADCINT1 will trigger SOC20. #br#  10  ADCINT2 will trigger SOC20. #br#  11  Invalid selection." begin="9" end="8" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC21" description="SOC21 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC21. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC21. TRIGSEL field alone determines SOC0 trigger. #br#  01  ADCINT1 will trigger SOC21. #br#  10  ADCINT2 will trigger SOC21. #br#  11  Invalid selection." begin="11" end="10" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC22" description="SOC22 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC22. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC22. TRIGSEL field alone determines SOC0 trigger. #br#  01  ADCINT1 will trigger SOC22. #br#  10  ADCINT2 will trigger SOC22. #br#  11  Invalid selection." begin="13" end="12" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC23" description="SOC23 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC23. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC23. TRIGSEL field alone determines SOC0 trigger. #br#  01  ADCINT1 will trigger SOC23. #br#  10  ADCINT2 will trigger SOC23. #br#  11  Invalid selection." begin="15" end="14" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC24" description="SOC24 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC24. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC24. TRIGSEL field alone determines SOC0 trigger. #br#  01  ADCINT1 will trigger SOC24. #br#  10  ADCINT2 will trigger SOC24. #br#  11  Invalid selection." begin="17" end="16" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC25" description="SOC25 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC25. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC25. TRIGSEL field alone determines SOC0 trigger. #br#  01  ADCINT1 will trigger SOC25. #br#  10  ADCINT2 will trigger SOC25. #br#  11  Invalid selection." begin="19" end="18" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC26" description="SOC26 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC26. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC26. TRIGSEL field alone determines SOC0 trigger. #br#  01  ADCINT1 will trigger SOC26. #br#  10  ADCINT2 will trigger SOC26. #br#  11  Invalid selection." begin="21" end="20" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC27" description="SOC27 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC27. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC27. TRIGSEL field alone determines SOC0 trigger. #br#  01  ADCINT1 will trigger SOC27. #br#  10  ADCINT2 will trigger SOC27. #br#  11  Invalid selection." begin="23" end="22" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC28" description="SOC28 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC28. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC28. TRIGSEL field alone determines SOC0 trigger. #br#  01  ADCINT1 will trigger SOC28. #br#  10  ADCINT2 will trigger SOC28. #br#  11  Invalid selection." begin="25" end="24" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC29" description="SOC29 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC29. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC29. TRIGSEL field alone determines SOC0 trigger. #br#  01  ADCINT1 will trigger SOC29. #br#  10  ADCINT2 will trigger SOC29. #br#  11  Invalid selection." begin="27" end="26" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC30" description="SOC30 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC30. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC30. TRIGSEL field alone determines SOC0 trigger. #br#  01  ADCINT1 will trigger SOC30. #br#  10  ADCINT2 will trigger SOC30. #br#  11  Invalid selection." begin="29" end="28" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC31" description="SOC31 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC31. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register. #br#  00  No ADCINT will trigger SOC31. TRIGSEL field alone determines SOC0 trigger. #br#  01  ADCINT1 will trigger SOC31. #br#  10  ADCINT2 will trigger SOC31. #br#  11  Invalid selection." begin="31" end="30" width="2" rwaccess="R/W">
        </bitfield>
    </register>
