ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC1_0.0.xml
    <register id="HSADC1_ADCSOCFLG1_LITE_FRC" width="32" offset="0x1040" description="ADC SOC Force 1 Register">
        <bitfield id="SOC0" description="SOC0 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC0 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0. #br# #br#  0  No action. #br#  1  Force SOC0 flag bit to 1. This will cause a conversion to start once priority is given to SOC0. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC0 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC1" description="SOC1 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC1 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0. #br# #br#  0  No action. #br#  1  Force SOC1 flag bit to 1. This will cause a conversion to start once priority is given to SOC1. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC1 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC2" description="SOC2 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC2 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0. #br# #br#  0  No action. #br#  1  Force SOC2 flag bit to 1. This will cause a conversion to start once priority is given to SOC2. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC2 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC3" description="SOC3 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC3 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0. #br# #br#  0  No action. #br#  1  Force SOC3 flag bit to 1. This will cause a conversion to start once priority is given to SOC3. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC3 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC4" description="SOC4 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC4 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0. #br# #br#  0  No action. #br#  1  Force SOC4 flag bit to 1. This will cause a conversion to start once priority is given to SOC4. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC4 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC5" description="SOC5 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC5 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0. #br# #br#  0  No action. #br#  1  Force SOC5 flag bit to 1. This will cause a conversion to start once priority is given to SOC5. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC5 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC6" description="SOC6 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC6 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0. #br# #br#  0  No action. #br#  1  Force SOC6 flag bit to 1. This will cause a conversion to start once priority is given to SOC6. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC6 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC7" description="SOC7 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC7 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0. #br# #br#  0  No action. #br#  1  Force SOC7 flag bit to 1. This will cause a conversion to start once priority is given to SOC7. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC7 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC8" description="SOC8 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC8 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0. #br# #br#  0  No action. #br#  1  Force SOC8 flag bit to 1. This will cause a conversion to start once priority is given to SOC8. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC8 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC9" description="SOC9 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC9 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0. #br# #br#  0  No action. #br#  1  Force SOC9 flag bit to 1. This will cause a conversion to start once priority is given to SOC9. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC9 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC10" description="SOC10 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC10 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0. #br# #br#  0  No action. #br#  1  Force SOC10 flag bit to 1. This will cause a conversion to start once priority is given to SOC10. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC10 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC11" description="SOC11 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC11 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0. #br# #br#  0  No action. #br#  1  Force SOC11 flag bit to 1. This will cause a conversion to start once priority is given to SOC11. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC11 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC12" description="SOC12 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC12 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0. #br# #br#  0  No action. #br#  1  Force SOC12 flag bit to 1. This will cause a conversion to start once priority is given to SOC12. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC12 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC13" description="SOC13 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC13 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0. #br# #br#  0  No action. #br#  1  Force SOC13 flag bit to 1. This will cause a conversion to start once priority is given to SOC13. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC13 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC14" description="SOC14 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC14 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0. #br# #br#  0  No action. #br#  1  Force SOC14 flag bit to 1. This will cause a conversion to start once priority is given to SOC14. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC14 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC15" description="SOC15 Force Start of Conversion Bit. Writing a 1 will force to 1 the SOC15 flag in the ADCSOCFLG1 register. This can be used to initiate a software initiated conversion. Writes of 0 are ignored. This bit will always read as a 0. #br# #br#  0  No action. #br#  1  Force SOC15 flag bit to 1. This will cause a conversion to start once priority is given to SOC15. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to clear the SOC15 bit in the ADCSOCFLG1 register, then software has priority and the ADCSOCFLG1 bit will be set. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether the ADCSOCFLG1 bit was previously set or not." begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSOCOVF1_M33_" width="32" offset="0x1044" description="ADC SOC Overflow 1 Register">
        <bitfield id="SOC0OVF" description="SOC0 Start of Conversion Overflow Flag. Indicates an SOC0 event was generated in hardware while an existing SOC0 event was already pending. #br# #br#  0  No SOC0 event overflow. #br#  1  SOC0 event overflow. #br# #br#An overflow condition does not stop SOC0 events from being processed. It simply is an indication that a hardware trigger was missed." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOC1OVF" description="SOC1 Start of Conversion Overflow Flag. Indicates an SOC1 event was generated in hardware while an existing SOC1 event was already pending. #br# #br#  0  No SOC1 event overflow. #br#  1  SOC1 event overflow. #br# #br#An overflow condition does not stop SOC1 events from being processed. It simply is an indication that a hardware trigger was missed." begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOC2OVF" description="SOC2 Start of Conversion Overflow Flag. Indicates an SOC2 event was generated in hardware while an existing SOC2 event was already pending. #br# #br#  0  No SOC2 event overflow. #br#  1  SOC2 event overflow. #br# #br#An overflow condition does not stop SOC2 events from being processed. It simply is an indication that a hardware trigger was missed." begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOC3OVF" description="SOC3 Start of Conversion Overflow Flag. Indicates an SOC3 event was generated in hardware while an existing SOC3 event was already pending. #br# #br#  0  No SOC3 event overflow. #br#  1  SOC3 event overflow. #br# #br#An overflow condition does not stop SOC3 events from being processed. It simply is an indication that a hardware trigger was missed." begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOC4OVF" description="SOC4 Start of Conversion Overflow Flag. Indicates an SOC4 event was generated in hardware while an existing SOC4 event was already pending. #br# #br#  0  No SOC4 event overflow. #br#  1  SOC4 event overflow. #br# #br#An overflow condition does not stop SOC4 events from being processed. It simply is an indication that a hardware trigger was missed." begin="4" end="4" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOC5OVF" description="SOC5 Start of Conversion Overflow Flag. Indicates an SOC5 event was generated in hardware while an existing SOC5 event was already pending. #br# #br#  0  No SOC5 event overflow. #br#  1  SOC5 event overflow. #br# #br#An overflow condition does not stop SOC5 events from being processed. It simply is an indication that a hardware trigger was missed." begin="5" end="5" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOC6OVF" description="SOC6 Start of Conversion Overflow Flag. Indicates an SOC6 event was generated in hardware while an existing SOC6 event was already pending. #br# #br#  0  No SOC6 event overflow. #br#  1  SOC6 event overflow. #br# #br#An overflow condition does not stop SOC6 events from being processed. It simply is an indication that a hardware trigger was missed." begin="6" end="6" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOC7OVF" description="SOC7 Start of Conversion Overflow Flag. Indicates an SOC7 event was generated in hardware while an existing SOC7 event was already pending. #br# #br#  0  No SOC7 event overflow. #br#  1  SOC7 event overflow. #br# #br#An overflow condition does not stop SOC7 events from being processed. It simply is an indication that a hardware trigger was missed." begin="7" end="7" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOC8OVF" description="SOC8 Start of Conversion Overflow Flag. Indicates an SOC8 event was generated in hardware while an existing SOC8 event was already pending. #br# #br#  0  No SOC8 event overflow. #br#  1  SOC8 event overflow. #br# #br#An overflow condition does not stop SOC8 events from being processed. It simply is an indication that a hardware trigger was missed." begin="8" end="8" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOC9OVF" description="SOC9 Start of Conversion Overflow Flag. Indicates an SOC9 event was generated in hardware while an existing SOC9 event was already pending. #br# #br#  0  No SOC9 event overflow. #br#  1  SOC9 event overflow. #br# #br#An overflow condition does not stop SOC9 events from being processed. It simply is an indication that a hardware trigger was missed." begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOC10OVF" description="SOC10 Start of Conversion Overflow Flag. Indicates an SOC10 event was generated in hardware while an existing SOC10 event was already pending. #br# #br#  0  No SOC10 event overflow. #br#  1  SOC10 event overflow. #br# #br#An overflow condition does not stop SOC10 events from being processed. It simply is an indication that a hardware trigger was missed." begin="10" end="10" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOC11OVF" description="SOC11 Start of Conversion Overflow Flag. Indicates an SOC11 event was generated in hardware while an existing SOC11 event was already pending. #br# #br#  0  No SOC11 event overflow. #br#  1  SOC11 event overflow. #br# #br#An overflow condition does not stop SOC11 events from being processed. It simply is an indication that a hardware trigger was missed." begin="11" end="11" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOC12OVF" description="SOC12 Start of Conversion Overflow Flag. Indicates an SOC12 event was generated in hardware while an existing SOC12 event was already pending. #br# #br#  0  No SOC12 event overflow. #br#  1  SOC12 event overflow. #br# #br#An overflow condition does not stop SOC12 events from being processed. It simply is an indication that a hardware trigger was missed." begin="12" end="12" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOC13OVF" description="SOC13 Start of Conversion Overflow Flag. Indicates an SOC13 event was generated in hardware while an existing SOC13 event was already pending. #br# #br#  0  No SOC13 event overflow. #br#  1  SOC13 event overflow. #br# #br#An overflow condition does not stop SOC13 events from being processed. It simply is an indication that a hardware trigger was missed." begin="13" end="13" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOC14OVF" description="SOC14 Start of Conversion Overflow Flag. Indicates an SOC14 event was generated in hardware while an existing SOC14 event was already pending. #br# #br#  0  No SOC14 event overflow. #br#  1  SOC14 event overflow. #br# #br#An overflow condition does not stop SOC14 events from being processed. It simply is an indication that a hardware trigger was missed." begin="14" end="14" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOC15OVF" description="SOC15 Start of Conversion Overflow Flag. Indicates an SOC15 event was generated in hardware while an existing SOC15 event was already pending. #br# #br#  0  No SOC15 event overflow. #br#  1  SOC15 event overflow. #br# #br#An overflow condition does not stop SOC15 events from being processed. It simply is an indication that a hardware trigger was missed." begin="15" end="15" width="1" rwaccess="R">
        </bitfield>
    </register>
