ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC1_0.0.xml
    <register id="HSADC1_ADCSOCOVF1_LITE_CLR" width="32" offset="0x1048" description="ADC SOC Overflow Clear 1 Register">
        <bitfield id="SOC0OVF" description="SOC0 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC0 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0. #br# #br#  0  No action. #br#  1  Clear SOC0 overflow flag. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC1OVF" description="SOC1 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC1 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0. #br# #br#  0  No action. #br#  1  Clear SOC1 overflow flag. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC2OVF" description="SOC2 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC2 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0. #br# #br#  0  No action. #br#  1  Clear SOC2 overflow flag. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC3OVF" description="SOC3 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC3 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0. #br# #br#  0  No action. #br#  1  Clear SOC3 overflow flag. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC4OVF" description="SOC4 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC4 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0. #br# #br#  0  No action. #br#  1  Clear SOC4 overflow flag. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC5OVF" description="SOC5 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC5 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0. #br# #br#  0  No action. #br#  1  Clear SOC5 overflow flag. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC6OVF" description="SOC6 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC6 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0. #br# #br#  0  No action. #br#  1  Clear SOC6 overflow flag. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC7OVF" description="SOC7 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC7 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0. #br# #br#  0  No action. #br#  1  Clear SOC7 overflow flag. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC8OVF" description="SOC8 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC8 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0. #br# #br#  0  No action. #br#  1  Clear SOC8 overflow flag. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC9OVF" description="SOC9 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC9 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0. #br# #br#  0  No action. #br#  1  Clear SOC9 overflow flag. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC10OVF" description="SOC10 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC10 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0. #br# #br#  0  No action. #br#  1  Clear SOC10 overflow flag. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC11OVF" description="SOC11 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC11 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0. #br# #br#  0  No action. #br#  1  Clear SOC11 overflow flag. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC12OVF" description="SOC12 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC12 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0. #br# #br#  0  No action. #br#  1  Clear SOC12 overflow flag. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC13OVF" description="SOC13 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC13 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0. #br# #br#  0  No action. #br#  1  Clear SOC13 overflow flag. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC14OVF" description="SOC14 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC14 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0. #br# #br#  0  No action. #br#  1  Clear SOC14 overflow flag. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SOC15OVF" description="SOC15 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC15 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0. #br# #br#  0  No action. #br#  1  Clear SOC15 overflow flag. #br# #br#If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSOC0CTL_M33_" width="32" offset="0x104C" description="ADC SOC0 Control Register">
        <bitfield id="CHSEL" description="SOC0 Channel Select. Selects the channel to be converted when SOC0 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC0 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSOC1CTL_M33_" width="32" offset="0x1050" description="ADC SOC1 Control Register">
        <bitfield id="CHSEL" description="SOC1 Channel Select. Selects the channel to be converted when SOC1 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC1 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSOC2CTL_M33_" width="32" offset="0x1054" description="ADC SOC2 Control Register">
        <bitfield id="CHSEL" description="SOC2 Channel Select. Selects the channel to be converted when SOC2 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC2 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSOC3CTL_M33_" width="32" offset="0x1058" description="ADC SOC3 Control Register">
        <bitfield id="CHSEL" description="SOC3 Channel Select. Selects the channel to be converted when SOC3 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC3 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSOC4CTL_M33_" width="32" offset="0x105C" description="ADC SOC4 Control Register">
        <bitfield id="CHSEL" description="SOC4 Channel Select. Selects the channel to be converted when SOC4 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC4 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSOC5CTL_M33_" width="32" offset="0x1060" description="ADC SOC5 Control Register">
        <bitfield id="CHSEL" description="SOC5 Channel Select. Selects the channel to be converted when SOC5 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC5 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSOC6CTL_M33_" width="32" offset="0x1064" description="ADC SOC6 Control Register">
        <bitfield id="CHSEL" description="SOC6 Channel Select. Selects the channel to be converted when SOC6 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC6 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSOC7CTL_M33_" width="32" offset="0x1068" description="ADC SOC7 Control Register">
        <bitfield id="CHSEL" description="SOC7 Channel Select. Selects the channel to be converted when SOC7 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC7 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSOC8CTL_M33_" width="32" offset="0x106C" description="ADC SOC8 Control Register">
        <bitfield id="CHSEL" description="SOC8 Channel Select. Selects the channel to be converted when SOC8 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC8 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSOC9CTL_M33_" width="32" offset="0x1070" description="ADC SOC9 Control Register">
        <bitfield id="CHSEL" description="SOC9 Channel Select. Selects the channel to be converted when SOC9 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC9 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
