ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC1_0.0.xml
    <register id="HSADC1_ADCEVTSEL_4PPB_" width="32" offset="0x10D4" description="ADC Event Selection Register">
        <bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB1INLIMIT" description="Post Processing Block 1 Within trip limit event enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2INLIMIT" description="Post Processing Block 2 Within trip limit event enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3INLIMIT" description="Post Processing Block 3 Within trip limit event enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4INLIMIT" description="Post Processing Block 4 Within trip limit event enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCEVTINTSEL_4PPB_" width="32" offset="0x10D8" description="ADC Event Interrupt Selection Register">
        <bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB1INLIMIT" description="Post Processing Block 1 Within trip limit Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2INLIMIT" description="Post Processing Block 2 Within trip limit Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3INLIMIT" description="Post Processing Block 3 Within trip limit Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4INLIMIT" description="Post Processing Block 4 Within trip limit Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCOSDETECT_HSADC12B_" width="32" offset="0x10DC" description="ADC Open and Shorts Detect Register">
        <bitfield id="DETECTCFG" description="ADC Opens and Shorts Detect Configuration. This bit field defines the open/shorts detection circuit state. #br# #br#  0h  Open/Shorts detection circuit is disabled. #br#  1h  Open/Shorts detection circuit is enabled at zero scale. #br#  2h  Open/Shorts detection circuit is enabled at full scale. #br#  3h  Open/Shorts detection circuit is enabled at (nominal) 5/12 scale. #br#  4h  Open/Shorts detection circuit is enabled at (nominal) 7/12 scale. #br#  5h  Open/Shorts detection circuit is enabled with a (nominal) 5K pulldown to VSSA. #br#  6h  Open/Shorts detection circuit is enabled with a (nominal) 5K pullup to VDDA. #br#  7h  Open/Shorts detection circuit is enabled with a (nominal) 7K pulldown to VSSA." begin="2" end="0" width="3" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCREV_HSADC12B_" width="32" offset="0x10E4" description="ADC Revision Register">
        <bitfield id="TYPE" description="ADC Type. Always set to 6 for this HSADC-12b." begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="REV" description="ADC Revision. To allow documentation of differences between revisions. First version is labeled as 00h." begin="31" end="8" width="24" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCOFFTRIM_LITE_" width="32" offset="0x10E8" description="ADC Offset Trim Register 1">
        <bitfield id="OFFTRIM" description="ADC Offset Trim #br# #br#Adjusts the conversion results of the converter up #br#or down to account for offset error in the ADC. A factory trim setting will be loaded during device boot. #br# #br#Offset can be corrected in the range of +7 to -8 LSBs. Value is 16*Offset in 8-bit 2's complement: #br# #br#7 LSB (16*7) = 112 #br#6 LSB (16*6) = 96 #br#5 LSB (16*5) = 80 #br#4 LSB (16*4) = 64 #br#3 LSB (16*3) = 48 #br#2 LSB (16*2) = 32 #br#1 LSB (16*1) = 16 #br#0 LSB (16*0) = 0 #br#-1 LSB (16*(-1)) = 240 #br#: #br#: #br#-7LSB(16*(-7)) = 144" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCCONFIG_12B_" width="32" offset="0x10F0" description="ADC Config Register">
    </register>
    <register id="HSADC1_ADCPPB1CONFIG_M33_" width="32" offset="0x1100" description="ADC PPB1 Config Register">
        <bitfield id="CBCEN" description="ADC Post Processing Block Cycle By Cycle Enable. When set, this bit enables the post conversion hardware processing circuit to automatically clear the ADCEVTSTAT on a conversion if the event condition is no longer present." begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TWOSCOMPEN" description="ADC Post Processing Block 1 Two's Complement Enable. When set this bit enables the post conversion hardware processing circuit that performs a two's complement on the output of the offset/reference subtraction unit before storing the result in the  ADCPPB1RESULT register. #br# #br#  0  ADCPPB1RESULT = ADCRESULTx - ADCPPB1OFFREF #br#  1  ADCPPB1RESULT = ADCPPB1OFFREF - ADCRESULTx" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB1OFFCAL_LITE_" width="32" offset="0x1108" description="ADC PPB1 Offset Calibration Register">
        <bitfield id="OFFCAL" description="ADC Post Processing Block 1 Offset Correction. This bit field can be used to digitally remove any system level offset inherent in the ADCIN circuit. This 6-bit signed value is subtracted from the ADC output before being stored in the ADCRESULT register. #br# #br#  00h  No change. The ADC output is stored directly into ADCRESULT. #br#  01h  ADC output - 1 is stored into ADCRESULT. #br#  02h  ADC output - 2 is stored into ADCRESULT. #br#  ... #br#  20h  ADC output + 32 is stored into ADCRESULT. #br#  ... #br#  3Fh  ADC output + 1 is stored into ADCRESULT. #br# #br#NOTE: The subtraction will saturate at 0000h and 0FFFh before being stored into the ADCRESULT register. #br# #br#Note: in the case that multiple PPBs point to the same SOC, only the OFFCAL of the lowest numbered PPB will be applied." begin="5" end="0" width="6" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB1OFFREF_LITE_" width="32" offset="0x110C" description="ADC PPB1 Offset Reference Register">
        <bitfield id="OFFREF" description="ADC Post Processing Block 1 Offset Correction. This bit field can be used to either calculate the feedback error or convert a unipolar signal to bipolar by subtracting a reference value. This 12-bit unsigned value is subtracted from the ADCRESULT register before being passed through an optional two's complement function and stored in the ADCPPB1RESULT register. This subtraction is not saturated. #br# #br#  0000h  No change. The ADCRESULT value is passed on. #br#  001h  ADCRESULT - 1 is passed on. #br#  002h  ADCRESULT - 2 is passed on. #br#  ... #br#  800h  ADCRESULT - 2048 is passed on. #br#  ... #br#  FFFh  ADCRESULT - 4096 is passed on." begin="11" end="0" width="12" rwaccess="R/W">
        </bitfield>
    </register>
