ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC1_0.0.xml
    <register id="HSADC1_ADCPPB1TRIPHI_LITE_" width="32" offset="0x1110" description="ADC PPB1 Trip High Register">
        <bitfield id="LIMITHI" description="ADC Post Processing Block 1 Trip High Limit. This value sets the digital comparator trip high limit. #br# #br#When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: #br#- TRIPHI[15:13] will be ignored" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB1TRIPLO_LITE_" width="32" offset="0x1114" description="ADC PPB1 Trip Low/Trigger Time Stamp Register">
        <bitfield id="LIMITLO" description="ADC Post Processing Block 1 Trip High Low Limit. This value sets the digital comparator trip low limit if ADCPPB1TRIPLO.LIMITLO2EN = 1.  #br# #br#When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: #br#- TRIPLO[15:13] will be ignored in 12 bit mode" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB2CONFIG_M33_" width="32" offset="0x1120" description="ADC PPB2 Config Register">
        <bitfield id="CBCEN" description="ADC Post Processing Block Cycle By Cycle Enable. When set, this bit enables the post conversion hardware processing circuit to automatically clear the ADCEVTSTAT on a conversion if the event condition is no longer present." begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TWOSCOMPEN" description="ADC Post Processing Block 2 Two's Complement Enable. When set this bit enables the post conversion hardware processing circuit that performs a two's complement on the output of the offset/reference subtraction unit before storing the result in the  ADCPPB2RESULT register. #br# #br#  0  ADCPPB2RESULT = ADCRESULTx - ADCPPB2OFFREF #br#  1  ADCPPB2RESULT = ADCPPB2OFFREF - ADCRESULTx" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB2OFFCAL_LITE_" width="32" offset="0x1128" description="ADC PPB2 Offset Calibration Register">
        <bitfield id="OFFCAL" description="ADC Post Processing Block 2 Offset Correction. This bit field can be used to digitally remove any system level offset inherent in the ADCIN circuit. This 6-bit signed value is subtracted from the ADC output before being stored in the ADCRESULT register. #br# #br#  00h  No change. The ADC output is stored directly into ADCRESULT. #br#  01h  ADC output - 1 is stored into ADCRESULT. #br#  02h  ADC output - 2 is stored into ADCRESULT. #br#  ... #br#  20h  ADC output + 32 is stored into ADCRESULT. #br#  ... #br#  3Fh  ADC output + 1 is stored into ADCRESULT. #br# #br#NOTE: The subtraction will saturate at 0000h and 0FFFh before being stored into the ADCRESULT register. #br# #br#Note: in the case that multiple PPBs point to the same SOC, only the OFFCAL of the lowest numbered PPB will be applied." begin="5" end="0" width="6" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB2OFFREF_LITE_" width="32" offset="0x112C" description="ADC PPB2 Offset Reference Register">
        <bitfield id="OFFREF" description="ADC Post Processing Block 2 Offset Correction. This bit field can be used to either calculate the feedback error or convert a unipolar signal to bipolar by subtracting a reference value. This 12-bit unsigned value is subtracted from the ADCRESULT register before being passed through an optional two's complement function and stored in the ADCPPB2RESULT register. This subtraction is not saturated. #br# #br#  0000h  No change. The ADCRESULT value is passed on. #br#  001h  ADCRESULT - 1 is passed on. #br#  002h  ADCRESULT - 2 is passed on. #br#  ... #br#  800h  ADCRESULT - 2048 is passed on. #br#  ... #br#  FFFh  ADCRESULT - 4096 is passed on." begin="11" end="0" width="12" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB2TRIPHI_LITE_" width="32" offset="0x1130" description="ADC PPB2 Trip High Register">
        <bitfield id="LIMITHI" description="ADC Post Processing Block 2 Trip High Limit. This value sets the digital comparator trip high limit. #br# #br#When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: #br#- TRIPHI[15:13] will be ignored" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB2TRIPLO_LITE_" width="32" offset="0x1134" description="ADC PPB2 Trip Low/Trigger Time Stamp Register">
        <bitfield id="LIMITLO" description="ADC Post Processing Block 2 Trip High Low Limit. This value sets the digital comparator trip low limit if ADCPPB2TRIPLO.LIMITLO2EN = 1.  #br# #br#When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: #br#- TRIPLO[15:13] will be ignored in 12 bit mode" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB3CONFIG_M33_" width="32" offset="0x1140" description="ADC PPB3 Config Register">
        <bitfield id="CBCEN" description="ADC Post Processing Block Cycle By Cycle Enable. When set, this bit enables the post conversion hardware processing circuit to automatically clear the ADCEVTSTAT on a conversion if the event condition is no longer present." begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TWOSCOMPEN" description="ADC Post Processing Block 3 Two's Complement Enable. When set this bit enables the post conversion hardware processing circuit that performs a two's complement on the output of the offset/reference subtraction unit before storing the result in the  ADCPPB3RESULT register. #br# #br#  0  ADCPPB3RESULT = ADCRESULTx - ADCPPB3OFFREF #br#  1  ADCPPB3RESULT = ADCPPB3OFFREF - ADCRESULTx" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB3OFFCAL_LITE_" width="32" offset="0x1148" description="ADC PPB3 Offset Calibration Register">
        <bitfield id="OFFCAL" description="ADC Post Processing Block 3 Offset Correction. This bit field can be used to digitally remove any system level offset inherent in the ADCIN circuit. This 6-bit signed value is subtracted from the ADC output before being stored in the ADCRESULT register. #br# #br#  00h  No change. The ADC output is stored directly into ADCRESULT. #br#  01h  ADC output - 1 is stored into ADCRESULT. #br#  02h  ADC output - 2 is stored into ADCRESULT. #br#  ... #br#  20h  ADC output + 32 is stored into ADCRESULT. #br#  ... #br#  3Fh  ADC output + 1 is stored into ADCRESULT. #br# #br#NOTE: The subtraction will saturate at 0000h and 0FFFh before being stored into the ADCRESULT register. #br# #br#Note: in the case that multiple PPBs point to the same SOC, only the OFFCAL of the lowest numbered PPB will be applied." begin="5" end="0" width="6" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB3OFFREF_LITE_" width="32" offset="0x114C" description="ADC PPB3 Offset Reference Register">
        <bitfield id="OFFREF" description="ADC Post Processing Block 3 Offset Correction. This bit field can be used to either calculate the feedback error or convert a unipolar signal to bipolar by subtracting a reference value. This 12-bit unsigned value is subtracted from the ADCRESULT register before being passed through an optional two's complement function and stored in the ADCPPB3RESULT register. This subtraction is not saturated. #br# #br#  0000h  No change. The ADCRESULT value is passed on. #br#  001h  ADCRESULT - 1 is passed on. #br#  002h  ADCRESULT - 2 is passed on. #br#  ... #br#  800h  ADCRESULT - 2048 is passed on. #br#  ... #br#  FFFh  ADCRESULT - 4096 is passed on." begin="11" end="0" width="12" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB3TRIPHI_LITE_" width="32" offset="0x1150" description="ADC PPB3 Trip High Register">
        <bitfield id="LIMITHI" description="ADC Post Processing Block 3 Trip High Limit. This value sets the digital comparator trip high limit. #br# #br#When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: #br#- TRIPHI[15:13] will be ignored" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB3TRIPLO_LITE_" width="32" offset="0x1154" description="ADC PPB3 Trip Low/Trigger Time Stamp Register">
        <bitfield id="LIMITLO" description="ADC Post Processing Block 3 Trip High Low Limit. This value sets the digital comparator trip low limit if ADCPPB3TRIPLO.LIMITLO2EN = 1.  #br# #br#When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: #br#- TRIPLO[15:13] will be ignored in 12 bit mode" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB4CONFIG_M33_" width="32" offset="0x1160" description="ADC PPB4 Config Register">
        <bitfield id="CBCEN" description="ADC Post Processing Block Cycle By Cycle Enable. When set, this bit enables the post conversion hardware processing circuit to automatically clear the ADCEVTSTAT on a conversion if the event condition is no longer present." begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TWOSCOMPEN" description="ADC Post Processing Block 4 Two's Complement Enable. When set this bit enables the post conversion hardware processing circuit that performs a two's complement on the output of the offset/reference subtraction unit before storing the result in the  ADCPPB4RESULT register. #br# #br#  0  ADCPPB4RESULT = ADCRESULTx - ADCPPB4OFFREF #br#  1  ADCPPB4RESULT = ADCPPB4OFFREF - ADCRESULTx" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB4OFFCAL_LITE_" width="32" offset="0x1168" description="ADC PPB4 Offset Calibration Register">
        <bitfield id="OFFCAL" description="ADC Post Processing Block 4 Offset Correction. This bit field can be used to digitally remove any system level offset inherent in the ADCIN circuit. This 6-bit signed value is subtracted from the ADC output before being stored in the ADCRESULT register. #br# #br#  00h  No change. The ADC output is stored directly into ADCRESULT. #br#  01h  ADC output - 1 is stored into ADCRESULT. #br#  02h  ADC output - 2 is stored into ADCRESULT. #br#  ... #br#  20h  ADC output + 32 is stored into ADCRESULT. #br#  ... #br#  3Fh  ADC output + 1 is stored into ADCRESULT. #br# #br#NOTE: The subtraction will saturate at 0000h and 0FFFh before being stored into the ADCRESULT register. #br# #br#Note: in the case that multiple PPBs point to the same SOC, only the OFFCAL of the lowest numbered PPB will be applied." begin="5" end="0" width="6" rwaccess="R/W">
        </bitfield>
    </register>
