ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC1_0.0.xml
    <register id="HSADC1_ADCPPB4OFFREF_LITE_" width="32" offset="0x116C" description="ADC PPB4 Offset Reference Register">
        <bitfield id="OFFREF" description="ADC Post Processing Block 4 Offset Correction. This bit field can be used to either calculate the feedback error or convert a unipolar signal to bipolar by subtracting a reference value. This 12-bit unsigned value is subtracted from the ADCRESULT register before being passed through an optional two's complement function and stored in the ADCPPB4RESULT register. This subtraction is not saturated. #br# #br#  0000h  No change. The ADCRESULT value is passed on. #br#  001h  ADCRESULT - 1 is passed on. #br#  002h  ADCRESULT - 2 is passed on. #br#  ... #br#  800h  ADCRESULT - 2048 is passed on. #br#  ... #br#  FFFh  ADCRESULT - 4096 is passed on." begin="11" end="0" width="12" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB4TRIPHI_LITE_" width="32" offset="0x1170" description="ADC PPB4 Trip High Register">
        <bitfield id="LIMITHI" description="ADC Post Processing Block 4 Trip High Limit. This value sets the digital comparator trip high limit. #br# #br#When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: #br#- TRIPHI[15:13] will be ignored" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB4TRIPLO_LITE_" width="32" offset="0x1174" description="ADC PPB4 Trip Low/Trigger Time Stamp Register">
        <bitfield id="LIMITLO" description="ADC Post Processing Block 4 Trip High Low Limit. This value sets the digital comparator trip low limit if ADCPPB4TRIPLO.LIMITLO2EN = 1.  #br# #br#When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: #br#- TRIPLO[15:13] will be ignored in 12 bit mode" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCINTCYCLE_LITE_" width="32" offset="0x1180" description="ADC Early Interrupt Generation Cycle">
        <bitfield id="DELAY" description="ADC Early Interrupt Generation Cycle Delay: Defines the delay from the fall edge of ADCSOC in terms of system clock cycles, for the interrupt to be generated." begin="5" end="0" width="6" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCINLTRIM1_TYPE3P1_" width="32" offset="0x1184" description="ADC Linearity Trim 1 Register">
    </register>
    <register id="HSADC1_ADCINLTRIM2_TYPE3P1_" width="32" offset="0x1188" description="ADC Linearity Trim 2 Register">
    </register>
    <register id="HSADC1_ADCINLTRIM3_TYPE3P1_" width="32" offset="0x118C" description="ADC Linearity Trim 3 Register">
    </register>
    <register id="HSADC1_ADCINLTRIM4_TYPE3P1_" width="32" offset="0x1190" description="ADC Linearity Trim 4 Register">
    </register>
    <register id="HSADC1_ADCINLTRIM5_TYPE3P1_" width="32" offset="0x1194" description="ADC Linearity Trim 5 Register">
    </register>
    <register id="HSADC1_ADCINLTRIM6_TYPE3P1_" width="32" offset="0x1198" description="ADC Linearity Trim 6 Register">
    </register>
    <register id="HSADC1_ADCREV2_LITE_" width="32" offset="0x119C" description="ADC Wrapper Revision Register">
        <bitfield id="WRAPPERTYPE" description="ADC Wrapper Type. Always set to 6 for this ADC." begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="WRAPPERREV" description="ADC Revision. To allow documentation of differences between revisions. First version is labeled as 00h." begin="31" end="8" width="24" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCINLTRIMCTL_HSADC12B_" width="32" offset="0x11A0" description="ADC Linearity Trim Control Register">
        <bitfield id="CALIBMODE" description="ADC Linearity Calibration Mode." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CALIBSTEP" description="ADC Linearity Calibration Step. Defines which of the 18 steps of calibration is to be executed." begin="5" end="1" width="5" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_REP1CTL_LITE_" width="32" offset="0x11C0" description="ADC Trigger Repeater 1 Control Register">
        <bitfield id="MODE" description="ADC trigger repeater 1 mode selection.  Select either oversampling or undersampling mode.   #br# #br#In oversampling mode, when the trigger selected by REP1CTL.TRIGSEL is received, the repeater will repeat the trigger REP1N.NSEL + 1 times. #br# #br#In undersampling mode, when the trigger selected by REP1CTL.TRIGSEL is received the first time, the repeater will pass the trigger through.  The next REP1N.NSEL triggers will be ignored.   #br# #br#0 = oversampling #br#1 = undersampling" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ACTIVEMODE" description="When a trigger is recived in oversampling or undersampling mode the value of MODE is copied to ACTIVEMODE.  ACTIVEMODE determines if the repeater will repeat of filter triggers.  Changes to MODE while the repeater is working therefore won't cause any changes in functionality until the module becomes idle and then a new trigger is received.  #br# #br#0 = module is oversampling #br#1 = module is undersampling" begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="MODULEBUSY" description="ADC Trigger Repeater 1 Module Busy indicator.  In oversampling mode: #br# #br#0 = Repeater 1 is idle and can accept a new repeated trigger in oversampling mode #br#1 = Repeater 1 still has repeated triggers remaining (NCOUNT &gt; 0) or associated SOCs are still pending (SOCBUSY is 1) #br# #br#If a new oversampled trigger is received while the module is still busy, the TRIGGEROVF bit will be set and the trigger will be ignored." begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOCBUSY" description="ADC Trigger Repeater 1 Associated SOCs Busy indicator.  In oversampling mode: #br# #br#0 = no SOCs associated with this repeater are pending #br#1 = SOCs associated with this repeater are still pending #br# #br#The next repeated trigger to the ADC in oversampling mode will not occur until SPREADCOUNT is 0 (minimum time is complete) and REP1CTL.BUSY = 0 (SOCs associated with trigger repeater 1 are no longer pending). #br# #br#Note: If the ADC is in burstmode and the BURSTTRIG is Repeater 1, then all round-robin SOCs are considered associated with this repeater and the repeater will not re-trigger until there are no pending round-robin SOCs (in addition to any associated pending high-priority SOCs)." begin="4" end="4" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PHASEOVF" description="ADC Trigger Repeater 1 Phase Delay Overflow. #br# #br#Indicates that a trigger was dropped because a trigger arrived when the phase delay logic was still waiting to send the delayed trigger (PHASECOUNT was not 0).   #br# #br#Writing a 1 will clear this flag. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TRIGGEROVF" description="ADC Trigger Repeater 1 Oversampled Trigger Overflow. #br# #br#Indicates that a trigger was dropped because a trigger arrived while the repeater was still generating repeated oversampled triggers (NCOUNT was not 0 or SOCs associated with Repeater 1 were still pending).   #br# #br#Writing a 1 will clear this flag. #br# #br#Note: This flag won't be set in undersampling mode or when NSEL = 0; if a trigger arrives before the previous SOCs have completed, the trigger will be passed and the overflow flags of the SOCs that were still pending will be set.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will remain set." begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TRIGGER" description="ADC Trigger Repeater 1 Trigger Select.  Selects the trigger to modify via oversampling or undersampling. #br# #br#  00h  REPTRIG0 - Software only #br#  01h-1FH   Hardware triggers" begin="12" end="8" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="SYNCINSEL" description="Trigger repeater 1 sync. input select.  On a sync. event, all registers in repeater 1 are reset to a ready and waiting state.  Values of NSEL, PHASE, and MODE are preserved. #br# #br#Note: SOCs associated with repeater 1 are not cleared.   #br# #br#0h = Disable Syncin to Repeater 1 #br#1h  - 1Fh  = Hardware syncin sources" begin="18" end="16" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="SWSYNC" description="Trigger repeater 1 software force sync.  On a sync. event, all registers in repeater 1 are reset to a ready and waiting state.  Values of NSEL, PHASE, and MODE are preserved.   #br# #br#Note: SOCs associated with repeater 1 are not cleared." begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_REP1N_LITE_" width="32" offset="0x11C4" description="ADC Trigger Repeater 1 N Select Register">
        <bitfield id="NSEL" description="ADC Trigger Repeater 1 selection of number of triggers. #br# #br#In oversampling mode, selects the number of repeated triggers. For each trigger received corresponding to REP1CTL.TRIGSEL, 2^NSEL triggers will be generated.   #br# #br#0 = 1 trigger is generated (pass-through) #br#1 = 2 triggers are generated #br#2 = 4 triggers are generated #br#3 = 8 triggers are generated  #br# #br#In undersampling mode, selects the number triggers to be supressed. 1 out NSEL + 1 triggers received corresponding to REP1CTL.TRIGSEL will be passed through (the first trigger will be passed through and the subsequent NSEL triggers will be supressed).   #br# #br#0 = all triggers are passed #br#1 = 1 out of 2 triggers are passed #br#2 = 1 out of 3 triggers are passed #br#... #br#127 = 1 out of 128 triggers are passed" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="NCOUNT" description="ADC trigger repeater 1 trigger count.   #br# #br#Indicates the number of triggers remaining to be generated.  If a trigger is received corresponding to REP1CTL.TRIGSEL while NCOUNT is not 0 (the repeater is still busy generating the repeated triggers) then the trigger will be ignored and REP1CTL.TRIGOVF will be set to 1." begin="18" end="16" width="3" rwaccess="R">
        </bitfield>
    </register>
