ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC1_0.0.xml
    <register id="HSADC1_REP2PHASE" width="32" offset="0x11E8" description="ADC Trigger Repeater 2 Phase Select Register">
        <bitfield id="PHASE" description="ADC trigger repeater 2 phase delay configuration.  Defines the number of SYSCLKs to delay the selected trigger before passing it on to the re-triggering logic.   #br# #br#0 = trigger is passed through without delay #br#1 = trigger is delayed by 1 SYSCLK #br#2 = trigger is delayed by 2 SYSCLKs #br#... #br#65535 = trigger is delayed by 65535 SYSCLKs" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
        <bitfield id="PHASECOUNT" description="ADC trigger repeater 2 phase delay status.  When the trigger selected by REP2CTL.TRIGSEL is received, this register will start counting down from PHASECOUNT until the counter reaches 0, at which point the trigger will be passed on to the repeater re-trigger logic.  #br# #br#If the trigger selected by REP2CTL.TRIGSEL is recieved when PHASECOUNT is not 0 (the phase delay logic is busy from the previous trigger) then the new trigger will be ignored and REP2CTL.PHASEOVF will be set to 1." begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_REP2SPREAD" width="32" offset="0x11EC" description="ADC Trigger Repeater 2 Spread Select Register">
        <bitfield id="SPREAD" description="ADC trigger repeater 2 spread delay configuration.  In oversampling mode, defines the minimum number of SYSCLKs to wait before creating the next repeated trigger to the ADC.   #br# #br#If SPREAD is less than the time needed for all SOCs associated with repeater 2 to sample and convert, then the repeater will generate triggers as fast as the ADC can convert the associated conversions. #br# #br#If SPREAD is greater than the time needed for all SOCs associated with repeater 2 to sample and convert, then repeated triggers to the ADC will be SPREAD SYSCLK cycles apart.   #br# #br#0 = oversampled repeated triggers occur as fast as the ADC can sample and convert associated SOCs #br#1 = time between repeated triggers is at least 1 SYSCLKs #br#2 = time between repeated triggers is at least 2 SYSCLKs #br#... #br#65535 =  time between repeated triggers is at least 65535 SYSCLKs" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
        <bitfield id="SPREADCOUNT" description="ADC trigger repeater 2 spread status.  When a trigger is sent to the ADC in oversampling mode, this register will start counting down from SPREAD until SPREADCOUNT equals 0.   #br# #br#The next repeated trigger to the ADC in oversampling mode will not occur until SPREADCOUNT is 0 (minimum time is complete) and REP2CTL.BUSY = 0 (SOCs associated with trigger repeater 2 are no longer pending)." begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_REP2FRC_LITE_" width="32" offset="0x11F0" description="ADC Trigger Repeater 2 Software Force Register">
        <bitfield id="SWFRC" description="Write 1 to force a trigger to repeat block 2 input regardless of the value of TRIGGER. #br# #br#Always reads 0." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB1LIMIT_LITE_" width="32" offset="0x1200" description="ADC PPB1Conversion Count Limit Register">
        <bitfield id="LIMIT" description="Post Processing Block 1 Oversampling Limit.  Defines the number of conversions to accumulate before PSUM is automatically loaded into SUM.   #br# #br#0 = No - accumulation #br#1 = 2 conversions are accumulated #br#2 = 4 conversions are accumulated #br#3 = 8 conversions are accumulated  #br#" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB1PCOUNT_LITE_" width="32" offset="0x1204" description="ADC PPB1 Partial Conversion Count Register">
        <bitfield id="PCOUNT" description="Post Processing Block 1 Oversampling Partial Count.  Each time a new result propagates through the PPB signal chain and accumulates into ADCPPB1PSUM this register is incremented by 1.   #br# #br#This register is reset when either a count-match event occurs (PCOUNT = LIMIT) or PPB1 receives a sync. event. #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB1RESULT timing information)." begin="2" end="0" width="3" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB1CONFIG2_M33_" width="32" offset="0x1208" description="ADC PPB1 Sum Shift Register">
        <bitfield id="SHIFT" description="Post Processing Block 1 right shift.  Defines the number of bits to right shift PSUM before loading into the final SUM.   #br# #br#0 : no right shift #br#1 : SUM = PSUM &gt;&gt; 1 #br#2 : SUM = PSUM &gt;&gt; 2 #br#... #br#7 : SUM = PSUM &gt;&gt; 7" begin="2" end="0" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="SYNCINSEL" description="PPB 1 sync. input select.  On a sync. event, all partial registers transfer to the final registers and are then reset.   #br#Refer to SOC spec for details" begin="6" end="4" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="SWSYNC" description="PPB 1 software force sync.  On a sync. event, all partial registers transfer to the final registers and are then reset.  #br# #br#Note: In the case where the software force occurs at the same time that a new sample is added to the PSUM and the PSUM is being used for a high or low limit compare, then the comparison will not occur." begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="OSINTSEL" description="Post Processing Block 1 Interrupt Source Select.  #br# #br#OSINT1 can be used to trigger an ADC interrupt (ADCINT1 through ADCINT4) via selection in the ADCINT1N2 or ADCINT3N4.  This selection determines if a sync. event can trigger OSINT1 in addition to a PCOUNT = LIMIT event.     #br#   #br#0 = OSINT1 will be generated from PCOUNT = LIMIT only #br#1 = OSTIN1 will be generated form PCOUNT = LIMIT or a sync. event.   #br# #br#Note: If a SYNC event would cause an OSINT one cycle after OSINT would have been cause by PCOUNT = LIMIT match, then the second OSINT is ignored." begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPSEL" description="Post Processing Block 1 Compare Source Select.  This field determines whether ADCPPB1RESULT or ADCPPB1SUM is used for the threshold compare. #br# #br#0 = ADCPPB1RESULT is used for compare logic #br#1 = ADCPPB1SUM is used for compare logic" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
    </register>
