ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC1_0.0.xml
    <register id="HSADC1_ADCPPB2PMIN" width="32" offset="0x1258" description="ADC PPB2 Partial MIN Register">
        <bitfield id="PMIN" description="Post Processing Block 2 Oversampling Partial Min.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB2RESULT the result replaces this register if it is smaller.   #br# #br#This register is reset when either a count-match event occurs (PCOUNT = LIMIT) or PPB2 receives a sync. event. #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB2RESULT timing information)." begin="16" end="0" width="17" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 16." begin="31" end="17" width="15" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB2TRIPLO2" width="32" offset="0x1260" description="ADC PPB2 Extended Trip Low Register">
        <bitfield id="LIMITLO" description="ADC Post Processing Block 2 Trip High Low Limit. This value sets the digital comparator trip low limit if ADCPPB2TRIPLO.LIMITLO2EN = 1.  #br# #br#When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: #br#- TRIPLO2[23:17] will be ignored in 16 bit mode #br#- TRIPLO2[23:13] will be ignored in 12 bit mode" begin="23" end="0" width="24" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB3LIMIT_LITE_" width="32" offset="0x1280" description="ADC PPB3Conversion Count Limit Register">
        <bitfield id="LIMIT" description="Post Processing Block 3 Oversampling Limit.  Defines the number of conversions to accumulate before PSUM is automatically loaded into SUM.   #br# #br#0 = No - accumulation #br#1 = 2 conversions are accumulated #br#2 = 4 conversions are accumulated #br#3 = 8 conversions are accumulated  #br#" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB3PCOUNT_LITE_" width="32" offset="0x1284" description="ADC PPB3 Partial Conversion Count Register">
        <bitfield id="PCOUNT" description="Post Processing Block 3 Oversampling Partial Count.  Each time a new result propagates through the PPB signal chain and accumulates into ADCPPB3PSUM this register is incremented by 1.   #br# #br#This register is reset when either a count-match event occurs (PCOUNT = LIMIT) or PPB3 receives a sync. event. #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB3RESULT timing information)." begin="2" end="0" width="3" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB3CONFIG2_M33_" width="32" offset="0x1288" description="ADC PPB3 Sum Shift Register">
        <bitfield id="SHIFT" description="Post Processing Block 3 right shift.  Defines the number of bits to right shift PSUM before loading into the final SUM.   #br# #br#0 : no right shift #br#1 : SUM = PSUM &gt;&gt; 1 #br#2 : SUM = PSUM &gt;&gt; 2 #br#... #br#7 : SUM = PSUM &gt;&gt; 7" begin="2" end="0" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="SYNCINSEL" description="PPB 3 sync. input select.  On a sync. event, all partial registers transfer to the final registers and are then reset.   #br#Refer to SOC spec for details" begin="6" end="4" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="SWSYNC" description="PPB 3 software force sync.  On a sync. event, all partial registers transfer to the final registers and are then reset.  #br# #br#Note: In the case where the software force occurs at the same time that a new sample is added to the PSUM and the PSUM is being used for a high or low limit compare, then the comparison will not occur." begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="OSINTSEL" description="Post Processing Block 3 Interrupt Source Select.  #br# #br#OSINT3 can be used to trigger an ADC interrupt (ADCINT1 through ADCINT4) via selection in the ADCINT1N2 or ADCINT3N4.  This selection determines if a sync. event can trigger OSINT3 in addition to a PCOUNT = LIMIT event.     #br#   #br#0 = OSINT3 will be generated from PCOUNT = LIMIT only #br#1 = OSTIN3 will be generated form PCOUNT = LIMIT or a sync. event.   #br# #br#Note: If a SYNC event would cause an OSINT one cycle after OSINT would have been cause by PCOUNT = LIMIT match, then the second OSINT is ignored." begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPSEL" description="Post Processing Block 3 Compare Source Select.  This field determines whether ADCPPB3RESULT or ADCPPB3SUM is used for the threshold compare. #br# #br#0 = ADCPPB3RESULT is used for compare logic #br#1 = ADCPPB3SUM is used for compare logic" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB3PSUM_LITE_" width="32" offset="0x128C" description="ADC PPB3 Partial Sum Register">
        <bitfield id="PSUM" description="Post Processing Block 3 Oversampling Partial Sum.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB3RESULT the result is subsequently accumulated into this register.   #br# #br#This register is reset when either a count-match event occurs (PCOUNT = LIMIT) or PPB3 receives a sync. event. #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available.  This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 2 SYSCLK cycle after the associated ADCRESULT and subsequent results (in order from lowest numbered PPB to highest) will each become available every 2-3 SYSCLK cycles (refer to the TRM for detailed timing information)." begin="15" end="0" width="16" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 15." begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
    </register>
