ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC1_0.0.xml
    <register id="HSADC1_ADCPPB4TRIPLO2" width="32" offset="0x12E0" description="ADC PPB4 Extended Trip Low Register">
        <bitfield id="LIMITLO" description="ADC Post Processing Block 4 Trip High Low Limit. This value sets the digital comparator trip low limit if ADCPPB4TRIPLO.LIMITLO2EN = 1.  #br# #br#When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: #br#- TRIPLO2[23:17] will be ignored in 16 bit mode #br#- TRIPLO2[23:13] will be ignored in 12 bit mode" begin="23" end="0" width="24" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_DTB_HSADC12B_" width="32" offset="0x130C" description="Digital Test Bus">
        <bitfield id="DTB_OUT" description="Digital Test Bus from HSADC12b" begin="15" end="0" width="16" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSEQCTL" width="32" offset="0x1320" description="ADC Sequencer common control Register">
        <bitfield id="SEQEND" description="END SOC of last enabled sequence" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQPREEMPT" description="SoC Sequence PREEMPT #br#0X: Pre-empt disabled #br#10: Pre-empt enabled and will not restart aborted Sequence #br#11: Pre-empt enabled and will restart aborted Sequence" begin="17" end="16" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSEQ1CONFIG" width="32" offset="0x1324" description="ADC Sequencer 1 Config register">
        <bitfield id="ACQPS" description="SOC1 Acquisition Prescale. Controls the sample and hold window for each SOC in this Seqeunce. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration. #br#S+H window values is defined based on a combonation of ACQPS[7:6]  and ACQPS[5:0] values #br#If ACQPS[7:6] value is #br#  &amp;quot;00&amp;quot; S+H window = ACQPS[5:0] + 1 sysclk cycles #br#  &amp;quot;01&amp;quot;  S+H window = 64 + ((ACQPS[5:0] +1) * 2) sysclk cycles #br#  &amp;quot;10&amp;quot;  S+H window = 192 + ((ACQPS[5:0] +1) * 4) sysclk cycles #br#  &amp;quot;11&amp;quot;  S+H window = 448 + ((ACQPS[5:0] +1) * 16) sysclk cycles" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="SAMPCAPRESETDISABLE" description="SOC1 Sample Cap Reset enable : Resets sample cap after conversion. #br#0 - The sample cap is reset after each conversion #br#1 - The sample cap is not reset after each conversion" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SAMPCAPRESETSEL" description="SOC1 Sample Cap Reset Select : Resets sample cap after conversion to either vrefhi/2 or vreflo #br#0 - The sample cap is reset to Vreflo after each conversion #br#1 - The sample cap is reset to Vrefhi/2 after each conversion" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQSTART" description="Beginning SOC of SEQ1" begin="18" end="15" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="TRIGSEL" description="SOC1 Trigger Source Select. Along with the SOC1 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC1 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it. #br# #br#Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration. #br#  0h  ADCTRIG0 - Software only #br#  1h - 7h  Hardware triggers" begin="22" end="20" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQSWFRC" description="Write 1 to force a trigger to Sequencer 1 regardless of the value of Hardware TRIGGER. #br# #br#Always reads 0." begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQENABLE" description="SEQ1Enable #br#Indicates whether the Sequence1 is enabled or not" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSEQ2CONFIG" width="32" offset="0x1328" description="ADC Sequencer 2 Config register">
        <bitfield id="ACQPS" description="SOC2 Acquisition Prescale. Controls the sample and hold window for each SOC in this Seqeunce. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration. #br#S+H window values is defined based on a combonation of ACQPS[7:6]  and ACQPS[5:0] values #br#If ACQPS[7:6] value is #br#  &amp;quot;00&amp;quot; S+H window = ACQPS[5:0] + 1 sysclk cycles #br#  &amp;quot;01&amp;quot;  S+H window = 64 + ((ACQPS[5:0] +1) * 2) sysclk cycles #br#  &amp;quot;10&amp;quot;  S+H window = 192 + ((ACQPS[5:0] +1) * 4) sysclk cycles #br#  &amp;quot;11&amp;quot;  S+H window = 448 + ((ACQPS[5:0] +1) * 16) sysclk cycles" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="SAMPCAPRESETDISABLE" description="SOC2 Sample Cap Reset enable : Resets sample cap after conversion. #br#0 - The sample cap is reset after each conversion #br#1 - The sample cap is not reset after each conversion" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SAMPCAPRESETSEL" description="SOC2 Sample Cap Reset Select : Resets sample cap after conversion to either vrefhi/2 or vreflo #br#0 - The sample cap is reset to Vreflo after each conversion #br#1 - The sample cap is reset to Vrefhi/2 after each conversion" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQSTART" description="Beginning SOC of SEQ2" begin="18" end="15" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="TRIGSEL" description="SOC2 Trigger Source Select. Along with the SOC2 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC2 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it. #br# #br#Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration. #br#  0h  ADCTRIG0 - Software only #br#  1h - 7h  Hardware triggers" begin="22" end="20" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQSWFRC" description="Write 1 to force a trigger to Sequencer 2 regardless of the value of Hardware TRIGGER. #br# #br#Always reads 0." begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQENABLE" description="SEQ2Enable #br#Indicates whether the Sequence2 is enabled or not" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSEQ3CONFIG" width="32" offset="0x132C" description="ADC Sequencer 3 Config register">
        <bitfield id="ACQPS" description="SOC3 Acquisition Prescale. Controls the sample and hold window for each SOC in this Seqeunce. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration. #br#S+H window values is defined based on a combonation of ACQPS[7:6]  and ACQPS[5:0] values #br#If ACQPS[7:6] value is #br#  &amp;quot;00&amp;quot; S+H window = ACQPS[5:0] + 1 sysclk cycles #br#  &amp;quot;01&amp;quot;  S+H window = 64 + ((ACQPS[5:0] +1) * 2) sysclk cycles #br#  &amp;quot;10&amp;quot;  S+H window = 192 + ((ACQPS[5:0] +1) * 4) sysclk cycles #br#  &amp;quot;11&amp;quot;  S+H window = 448 + ((ACQPS[5:0] +1) * 16) sysclk cycles" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="SAMPCAPRESETDISABLE" description="SOC3 Sample Cap Reset enable : Resets sample cap after conversion. #br#0 - The sample cap is reset after each conversion #br#1 - The sample cap is not reset after each conversion" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SAMPCAPRESETSEL" description="SOC3 Sample Cap Reset Select : Resets sample cap after conversion to either vrefhi/2 or vreflo #br#0 - The sample cap is reset to Vreflo after each conversion #br#1 - The sample cap is reset to Vrefhi/2 after each conversion" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQSTART" description="Beginning SOC of SEQ3" begin="18" end="15" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="TRIGSEL" description="SOC3 Trigger Source Select. Along with the SOC3 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC3 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it. #br# #br#Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration. #br#  0h  ADCTRIG0 - Software only #br#  1h - 7h  Hardware triggers" begin="22" end="20" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQSWFRC" description="Write 1 to force a trigger to Sequencer 3 regardless of the value of Hardware TRIGGER. #br# #br#Always reads 0." begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQENABLE" description="SEQ3Enable #br#Indicates whether the Sequence3 is enabled or not" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
