ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC1_0.0.xml
    <register id="HSADC1_ADCSEQ4CONFIG" width="32" offset="0x1330" description="ADC Sequencer 4 Config register">
        <bitfield id="ACQPS" description="SOC4 Acquisition Prescale. Controls the sample and hold window for each SOC in this Seqeunce. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration. #br#S+H window values is defined based on a combonation of ACQPS[7:6]  and ACQPS[5:0] values #br#If ACQPS[7:6] value is #br#  &amp;quot;00&amp;quot; S+H window = ACQPS[5:0] + 1 sysclk cycles #br#  &amp;quot;01&amp;quot;  S+H window = 64 + ((ACQPS[5:0] +1) * 2) sysclk cycles #br#  &amp;quot;10&amp;quot;  S+H window = 192 + ((ACQPS[5:0] +1) * 4) sysclk cycles #br#  &amp;quot;11&amp;quot;  S+H window = 448 + ((ACQPS[5:0] +1) * 16) sysclk cycles" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="SAMPCAPRESETDISABLE" description="SOC4 Sample Cap Reset enable : Resets sample cap after conversion. #br#0 - The sample cap is reset after each conversion #br#1 - The sample cap is not reset after each conversion" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SAMPCAPRESETSEL" description="SOC4 Sample Cap Reset Select : Resets sample cap after conversion to either vrefhi/2 or vreflo #br#0 - The sample cap is reset to Vreflo after each conversion #br#1 - The sample cap is reset to Vrefhi/2 after each conversion" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQSTART" description="Beginning SOC of SEQ4" begin="18" end="15" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="TRIGSEL" description="SOC4 Trigger Source Select. Along with the SOC4 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC4 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it. #br# #br#Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration. #br#  0h  ADCTRIG0 - Software only #br#  1h - 7h  Hardware triggers" begin="22" end="20" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQSWFRC" description="Write 1 to force a trigger to Sequencer 4 regardless of the value of Hardware TRIGGER. #br# #br#Always reads 0." begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQENABLE" description="SEQ4Enable #br#Indicates whether the Sequence4 is enabled or not" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC1_ADCRESULT0_12B_M33" width="16" offset="0x5000" description="ADC Result 0 Register">
    </register>
    <register id="HSADC1_ADCRESULT1_12B_M33" width="16" offset="0x5002" description="ADC Result 1 Register">
    </register>
    <register id="HSADC1_ADCRESULT2_12B_M33" width="16" offset="0x5004" description="ADC Result 2 Register">
    </register>
    <register id="HSADC1_ADCRESULT3_12B_M33" width="16" offset="0x5006" description="ADC Result 3 Register">
    </register>
    <register id="HSADC1_ADCRESULT4_12B_M33" width="16" offset="0x5008" description="ADC Result 4 Register">
    </register>
    <register id="HSADC1_ADCRESULT5_12B_M33" width="16" offset="0x500A" description="ADC Result 5 Register">
    </register>
    <register id="HSADC1_ADCRESULT6_12B_M33" width="16" offset="0x500C" description="ADC Result 6 Register">
    </register>
    <register id="HSADC1_ADCRESULT7_12B_M33" width="16" offset="0x500E" description="ADC Result 7 Register">
    </register>
    <register id="HSADC1_ADCRESULT8_12B_M33" width="16" offset="0x5010" description="ADC Result 8 Register">
    </register>
    <register id="HSADC1_ADCRESULT9_12B_M33" width="16" offset="0x5012" description="ADC Result 9 Register">
    </register>
    <register id="HSADC1_ADCRESULT10_12B_M33" width="16" offset="0x5014" description="ADC Result 10 Register">
    </register>
    <register id="HSADC1_ADCRESULT11_12B_M33" width="16" offset="0x5016" description="ADC Result 11 Register">
    </register>
    <register id="HSADC1_ADCRESULT12_12B_M33" width="16" offset="0x5018" description="ADC Result 12 Register">
    </register>
    <register id="HSADC1_ADCRESULT13_12B_M33" width="16" offset="0x501A" description="ADC Result 13 Register">
    </register>
    <register id="HSADC1_ADCRESULT14_12B_M33" width="16" offset="0x501C" description="ADC Result 14 Register">
    </register>
    <register id="HSADC1_ADCRESULT15_12B_M33" width="16" offset="0x501E" description="ADC Result 15 Register">
    </register>
    <register id="HSADC1_ADCPPB1RESULT_12B_" width="32" offset="0x5040" description="ADC Post Processing Block 1 Result Register">
        <bitfield id="PPBRESULT" description="ADC Post Processing Block Result 1 #br# #br#The result of the offset/reference subtraction post conversion processing is stored in this register.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 1 SYSCLK cycle after the associated ADCRESULT and subsequent results (in order from lowest numbered PPB to highest) will each become available every 2-3 SYSCLK cycles (refer to the TRM for more detailed timing information).  #br# #br#If ADCINTFLG is polled to determine when to read the PPBRESULT, it may be necessary to add one or more NOP instructions to ensure that the updated post conversion processing result has posted to the register. #br# #br#NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the PPBRESULT bits are limited to bits 12:0." begin="12" end="0" width="13" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 12. #br# #br#NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the SIGN bits extend down to bit 12, and all reflect the same value as bit 12." begin="31" end="13" width="19" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB2RESULT_12B_" width="32" offset="0x5044" description="ADC Post Processing Block 2 Result Register">
        <bitfield id="PPBRESULT" description="ADC Post Processing Block Result 2 #br# #br#The result of the offset/reference subtraction post conversion processing is stored in this register.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 1 SYSCLK cycle after the associated ADCRESULT and subsequent results (in order from lowest numbered PPB to highest) will each become available every 2-3 SYSCLK cycles (refer to the TRM for more detailed timing information).  #br# #br#If ADCINTFLG is polled to determine when to read the PPBRESULT, it may be necessary to add one or more NOP instructions to ensure that the updated post conversion processing result has posted to the register. #br# #br#NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the PPBRESULT bits are limited to bits 12:0." begin="12" end="0" width="13" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 12. #br# #br#NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the SIGN bits extend down to bit 12, and all reflect the same value as bit 12." begin="31" end="13" width="19" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB3RESULT_12B_" width="32" offset="0x5048" description="ADC Post Processing Block 3 Result Register">
        <bitfield id="PPBRESULT" description="ADC Post Processing Block Result 3 #br# #br#The result of the offset/reference subtraction post conversion processing is stored in this register.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 1 SYSCLK cycle after the associated ADCRESULT and subsequent results (in order from lowest numbered PPB to highest) will each become available every 2-3 SYSCLK cycles (refer to the TRM for more detailed timing information).  #br# #br#If ADCINTFLG is polled to determine when to read the PPBRESULT, it may be necessary to add one or more NOP instructions to ensure that the updated post conversion processing result has posted to the register. #br# #br#NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the PPBRESULT bits are limited to bits 12:0." begin="12" end="0" width="13" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 12. #br# #br#NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the SIGN bits extend down to bit 12, and all reflect the same value as bit 12." begin="31" end="13" width="19" rwaccess="R">
        </bitfield>
    </register>
