ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC1_0.0.xml
    <register id="HSADC1_ADCPPB4RESULT_12B_" width="32" offset="0x504C" description="ADC Post Processing Block 4 Result Register">
        <bitfield id="PPBRESULT" description="ADC Post Processing Block Result 4 #br# #br#The result of the offset/reference subtraction post conversion processing is stored in this register.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 1 SYSCLK cycle after the associated ADCRESULT and subsequent results (in order from lowest numbered PPB to highest) will each become available every 2-3 SYSCLK cycles (refer to the TRM for more detailed timing information).  #br# #br#If ADCINTFLG is polled to determine when to read the PPBRESULT, it may be necessary to add one or more NOP instructions to ensure that the updated post conversion processing result has posted to the register. #br# #br#NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the PPBRESULT bits are limited to bits 12:0." begin="12" end="0" width="13" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 12. #br# #br#NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the SIGN bits extend down to bit 12, and all reflect the same value as bit 12." begin="31" end="13" width="19" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB1SUM_LITE_" width="32" offset="0x5050" description="ADC PPB 1 Final Sum Result Register">
        <bitfield id="SUM" description="Post Processing Block 1 Oversampling Final Sum. When either a count-match event occurs (PCOUNT = LIMIT) or PPB1 receives a sync. event, the value of PSUM is loaded into this register.  In the case of a count-match event, the sum loaded into this register includes the value from the most recent conversion.  #br# #br#The value from PSUM will be right shifted by the amount specified in the SHIFT register before being loaded into the final SUM result register. #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB1RESULT timing information)." begin="15" end="0" width="16" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 15." begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB1COUNT_LITE_" width="16" offset="0x5054" description="ADC PPB1 Final Conversion Count Register">
        <bitfield id="COUNT" description="Post Processing Block 1 Oversampling Final Count. When either a count-match event occurs (PCOUNT = LIMIT) or PPB1 receives a sync. event, the value of PCOUNT is loaded into this register. #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB1RESULT timing information)." begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB2SUM_LITE_" width="32" offset="0x5058" description="ADC PPB 2 Final Sum Result Register">
        <bitfield id="SUM" description="Post Processing Block 2 Oversampling Final Sum. When either a count-match event occurs (PCOUNT = LIMIT) or PPB2 receives a sync. event, the value of PSUM is loaded into this register.  In the case of a count-match event, the sum loaded into this register includes the value from the most recent conversion.  #br# #br#The value from PSUM will be right shifted by the amount specified in the SHIFT register before being loaded into the final SUM result register. #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB2RESULT timing information)." begin="15" end="0" width="16" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 15." begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB2COUNT_LITE_" width="16" offset="0x505C" description="ADC PPB2 Final Conversion Count Register">
        <bitfield id="COUNT" description="Post Processing Block 2 Oversampling Final Count. When either a count-match event occurs (PCOUNT = LIMIT) or PPB2 receives a sync. event, the value of PCOUNT is loaded into this register. #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB2RESULT timing information)." begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB3SUM_LITE_" width="32" offset="0x5060" description="ADC PPB 3 Final Sum Result Register">
        <bitfield id="SUM" description="Post Processing Block 3 Oversampling Final Sum. When either a count-match event occurs (PCOUNT = LIMIT) or PPB3 receives a sync. event, the value of PSUM is loaded into this register.  In the case of a count-match event, the sum loaded into this register includes the value from the most recent conversion.  #br# #br#The value from PSUM will be right shifted by the amount specified in the SHIFT register before being loaded into the final SUM result register. #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB3RESULT timing information)." begin="15" end="0" width="16" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 15." begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB3COUNT_LITE_" width="16" offset="0x5064" description="ADC PPB3 Final Conversion Count Register">
        <bitfield id="COUNT" description="Post Processing Block 3 Oversampling Final Count. When either a count-match event occurs (PCOUNT = LIMIT) or PPB3 receives a sync. event, the value of PCOUNT is loaded into this register. #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB3RESULT timing information)." begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB4SUM_LITE_" width="32" offset="0x5068" description="ADC PPB 4 Final Sum Result Register">
        <bitfield id="SUM" description="Post Processing Block 4 Oversampling Final Sum. When either a count-match event occurs (PCOUNT = LIMIT) or PPB4 receives a sync. event, the value of PSUM is loaded into this register.  In the case of a count-match event, the sum loaded into this register includes the value from the most recent conversion.  #br# #br#The value from PSUM will be right shifted by the amount specified in the SHIFT register before being loaded into the final SUM result register. #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB4RESULT timing information)." begin="15" end="0" width="16" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 15." begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB4COUNT_LITE_" width="16" offset="0x506C" description="ADC PPB4 Final Conversion Count Register">
        <bitfield id="COUNT" description="Post Processing Block 4 Oversampling Final Count. When either a count-match event occurs (PCOUNT = LIMIT) or PPB4 receives a sync. event, the value of PCOUNT is loaded into this register. #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB4RESULT timing information)." begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB1MAX" width="32" offset="0x5070" description="ADC PPB 1 Final Max Result Register">
        <bitfield id="MAX" description="Post Processing Block 1 Oversampling Final Max. When either a count-match event occurs (PCOUNT = LIMIT) or PPB1 receives a sync. event, the value of PMAX is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available (only when a count-match event occurs).  This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB1RESULT timing information)." begin="16" end="0" width="17" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 16." begin="31" end="17" width="15" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB1MAXI" width="16" offset="0x5074" description="ADC PPB 1 Final Max Index Result Register">
        <bitfield id="MAXI" description="Post Processing Block 1 Oversampling Final Index of the Max. When either a count-match event occurs (PCOUNT = LIMIT) or PPB1 receives a sync. event, the value of PMAXI is loaded into this register.  In the case of a count-match event, the max index loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB1RESULT timing information)." begin="9" end="0" width="10" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB1MIN" width="32" offset="0x5078" description="ADC PPB 1 Final Min Result Register">
        <bitfield id="MIN" description="Post Processing Block 1 Oversampling Final Min. When either a count-match event occurs (PCOUNT = LIMIT) or PPB1 receives a sync. event, the value of PMIN is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB1RESULT timing information)." begin="16" end="0" width="17" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 16." begin="31" end="17" width="15" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB1MINI" width="16" offset="0x507C" description="ADC PPB 1 Final Min Index Result Register">
        <bitfield id="MINI" description="Post Processing Block 1 Oversampling Final Index of the Min. When either a count-match event occurs (PCOUNT = LIMIT) or PPB1 receives a sync. event, the value of PMINI is loaded into this register.  In the case of a count-match event, the min index loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB1RESULT timing information)." begin="9" end="0" width="10" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB2MAX" width="32" offset="0x5080" description="ADC PPB 2 Final Max Result Register">
        <bitfield id="MAX" description="Post Processing Block 2 Oversampling Final Max. When either a count-match event occurs (PCOUNT = LIMIT) or PPB2 receives a sync. event, the value of PMAX is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available (only when a count-match event occurs).  This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB2RESULT timing information)." begin="16" end="0" width="17" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 16." begin="31" end="17" width="15" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB2MAXI" width="16" offset="0x5084" description="ADC PPB 2 Final Max Index Result Register">
        <bitfield id="MAXI" description="Post Processing Block 2 Oversampling Final Index of the Max. When either a count-match event occurs (PCOUNT = LIMIT) or PPB2 receives a sync. event, the value of PMAXI is loaded into this register.  In the case of a count-match event, the max index loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB2RESULT timing information)." begin="9" end="0" width="10" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB2MIN" width="32" offset="0x5088" description="ADC PPB 2 Final Min Result Register">
        <bitfield id="MIN" description="Post Processing Block 2 Oversampling Final Min. When either a count-match event occurs (PCOUNT = LIMIT) or PPB2 receives a sync. event, the value of PMIN is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB2RESULT timing information)." begin="16" end="0" width="17" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 16." begin="31" end="17" width="15" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB2MINI" width="16" offset="0x508C" description="ADC PPB 2 Final Min Index Result Register">
        <bitfield id="MINI" description="Post Processing Block 2 Oversampling Final Index of the Min. When either a count-match event occurs (PCOUNT = LIMIT) or PPB2 receives a sync. event, the value of PMINI is loaded into this register.  In the case of a count-match event, the min index loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB2RESULT timing information)." begin="9" end="0" width="10" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB3MAX" width="32" offset="0x5090" description="ADC PPB 3 Final Max Result Register">
        <bitfield id="MAX" description="Post Processing Block 3 Oversampling Final Max. When either a count-match event occurs (PCOUNT = LIMIT) or PPB3 receives a sync. event, the value of PMAX is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available (only when a count-match event occurs).  This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB3RESULT timing information)." begin="16" end="0" width="17" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 16." begin="31" end="17" width="15" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB3MAXI" width="16" offset="0x5094" description="ADC PPB 3 Final Max Index Result Register">
        <bitfield id="MAXI" description="Post Processing Block 3 Oversampling Final Index of the Max. When either a count-match event occurs (PCOUNT = LIMIT) or PPB3 receives a sync. event, the value of PMAXI is loaded into this register.  In the case of a count-match event, the max index loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB3RESULT timing information)." begin="9" end="0" width="10" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB3MIN" width="32" offset="0x5098" description="ADC PPB 3 Final Min Result Register">
        <bitfield id="MIN" description="Post Processing Block 3 Oversampling Final Min. When either a count-match event occurs (PCOUNT = LIMIT) or PPB3 receives a sync. event, the value of PMIN is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB3RESULT timing information)." begin="16" end="0" width="17" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 16." begin="31" end="17" width="15" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB3MINI" width="16" offset="0x509C" description="ADC PPB 3 Final Min Index Result Register">
        <bitfield id="MINI" description="Post Processing Block 3 Oversampling Final Index of the Min. When either a count-match event occurs (PCOUNT = LIMIT) or PPB3 receives a sync. event, the value of PMINI is loaded into this register.  In the case of a count-match event, the min index loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB3RESULT timing information)." begin="9" end="0" width="10" rwaccess="R">
        </bitfield>
    </register>
