ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC1_0.0.xml
    <register id="HSADC1_ADCPPB4MAX" width="32" offset="0x50A0" description="ADC PPB 4 Final Max Result Register">
        <bitfield id="MAX" description="Post Processing Block 4 Oversampling Final Max. When either a count-match event occurs (PCOUNT = LIMIT) or PPB4 receives a sync. event, the value of PMAX is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available (only when a count-match event occurs).  This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB4RESULT timing information)." begin="16" end="0" width="17" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 16." begin="31" end="17" width="15" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB4MAXI" width="16" offset="0x50A4" description="ADC PPB 4 Final Max Index Result Register">
        <bitfield id="MAXI" description="Post Processing Block 4 Oversampling Final Index of the Max. When either a count-match event occurs (PCOUNT = LIMIT) or PPB4 receives a sync. event, the value of PMAXI is loaded into this register.  In the case of a count-match event, the max index loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB4RESULT timing information)." begin="9" end="0" width="10" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB4MIN" width="32" offset="0x50A8" description="ADC PPB 4 Final Min Result Register">
        <bitfield id="MIN" description="Post Processing Block 4 Oversampling Final Min. When either a count-match event occurs (PCOUNT = LIMIT) or PPB4 receives a sync. event, the value of PMIN is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB4RESULT timing information)." begin="16" end="0" width="17" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 16." begin="31" end="17" width="15" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCPPB4MINI" width="16" offset="0x50AC" description="ADC PPB 4 Final Min Index Result Register">
        <bitfield id="MINI" description="Post Processing Block 4 Oversampling Final Index of the Min. When either a count-match event occurs (PCOUNT = LIMIT) or PPB4 receives a sync. event, the value of PMINI is loaded into this register.  In the case of a count-match event, the min index loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB4RESULT timing information)." begin="9" end="0" width="10" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSEQ1FIFORESULT" width="32" offset="0x50C0" description="ADC Sequence 1 FIFO Result Register">
    </register>
    <register id="HSADC1_ADCSEQ2FIFORESULT" width="32" offset="0x50C4" description="ADC Sequence 2 FIFO Result Register">
    </register>
    <register id="HSADC1_ADCSEQ3FIFORESULT" width="32" offset="0x50C8" description="ADC Sequence 3 FIFO Result Register">
    </register>
    <register id="HSADC1_ADCSEQ4FIFORESULT" width="32" offset="0x50CC" description="ADC Sequence 4 FIFO Result Register">
    </register>
    <register id="HSADC1_ADCSEQ1FIFOSTATUS" width="32" offset="0x50D0" description="ADC Sequence 1 FIFO Status">
        <bitfield id="SEQFIFOVALID" description="Sequencer 1 FIFO Valid #br#0 -  All Conversions associated with the current Sequencer are NOT complete. #br#1 - Conversion from all the SOCs associated with the Sequencer are complete and result is available to be read." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SEQFIFOPENDREAD" description="Sequencer 1 FIFO pending reads #br#Note:  #br#1. This field is only updated when after the last byte of ADCSEQ1FIFORESULT is read. #br#2. The Pending read information will not be updated for debug reads.  #br#3. Once all the data in the FIFO has been read, FIFO will wrap back. Subsequent reads will read from the beginning of the FIFO." begin="4" end="1" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSEQ2FIFOSTATUS" width="32" offset="0x50D4" description="ADC Sequence 2 FIFO Status">
        <bitfield id="SEQFIFOVALID" description="Sequencer 2 FIFO Valid #br#0 -  All Conversions associated with the current Sequencer are NOT complete. #br#1 - Conversion from all the SOCs associated with the Sequencer are complete and result is available to be read." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SEQFIFOPENDREAD" description="Sequencer 2 FIFO pending reads #br#Note:  #br#1. This field is only updated when after the last byte of ADCSEQ2FIFORESULT is read. #br#2. The Pending read information will not be updated for debug reads.  #br#3. Once all the data in the FIFO has been read, FIFO will wrap back. Subsequent reads will read from the beginning of the FIFO." begin="4" end="1" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSEQ3FIFOSTATUS" width="32" offset="0x50D8" description="ADC Sequence 3 FIFO Status">
        <bitfield id="SEQFIFOVALID" description="Sequencer 3 FIFO Valid #br#0 -  All Conversions associated with the current Sequencer are NOT complete. #br#1 - Conversion from all the SOCs associated with the Sequencer are complete and result is available to be read." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SEQFIFOPENDREAD" description="Sequencer 3 FIFO pending reads #br#Note:  #br#1. This field is only updated when after the last byte of ADCSEQ3FIFORESULT is read. #br#2. The Pending read information will not be updated for debug reads.  #br#3. Once all the data in the FIFO has been read, FIFO will wrap back. Subsequent reads will read from the beginning of the FIFO." begin="4" end="1" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC1_ADCSEQ4FIFOSTATUS" width="32" offset="0x50DC" description="ADC Sequence 4 FIFO Status">
        <bitfield id="SEQFIFOVALID" description="Sequencer 4 FIFO Valid #br#0 -  All Conversions associated with the current Sequencer are NOT complete. #br#1 - Conversion from all the SOCs associated with the Sequencer are complete and result is available to be read." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SEQFIFOPENDREAD" description="Sequencer 4 FIFO pending reads #br#Note:  #br#1. This field is only updated when after the last byte of ADCSEQ4FIFORESULT is read. #br#2. The Pending read information will not be updated for debug reads.  #br#3. Once all the data in the FIFO has been read, FIFO will wrap back. Subsequent reads will read from the beginning of the FIFO." begin="4" end="1" width="4" rwaccess="R">
        </bitfield>
    </register>

</module>